# StructuralAttachmentStartLevelReference Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..StructuralAttachmentStartLevelReference Property
ParameterTypeId Class See Also
---
"Start Attachment Level Reference"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId StructuralAttachmentStartLevelReference { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property StructuralAttachmentStartLevelReference As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ StructuralAttachmentStartLevelReference {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace